Revit 2015 API
ExporterIFCRegistry Class
 Application level singleton that stores registered IFC exporters.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This class is obsolete in Revit 2014.  Use the methods of ExternalServiceFramework to register alternate IFC export servers, to inquire information about registered servers, and to remove unneeded servers.")]
public class ExporterIFCRegistry : IDisposable
Visual Basic
<ObsoleteAttribute("This class is obsolete in Revit 2014.  Use the methods of ExternalServiceFramework to register alternate IFC export servers, to inquire information about registered servers, and to remove unneeded servers.")> _
Public Class ExporterIFCRegistry _
	Implements IDisposable
Visual C++
[ObsoleteAttribute(L"This class is obsolete in Revit 2014.  Use the methods of ExternalServiceFramework to register alternate IFC export servers, to inquire information about registered servers, and to remove unneeded servers.")]
public ref class ExporterIFCRegistry : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.ExporterIFCRegistry
See Also
ExporterIFCRegistry Members
Autodesk.Revit.DB.IFC Namespace